---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsCorruption
source: html/689a35bb-309a-b35d-00c7-6d79f94b3b97.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsCorruption Property

Unable to array this mixture of modeling and view specific elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArrayMixedModAndViewSpecElemsCorruption { get; }
```